---
title: WallFailures
classe: Autodesk.Revit.DB.BuiltInFailures+WallFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 59
---

# WallFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotChangeSubwall { get; }` | `WallFailures.CannotChangeSubwall` | FailureDefinitionId |
| `FailureDefinitionId CannotChangeTypeOfOldCurtainPanel { get; }` | `WallFailures.CannotChangeTypeOfOldCurtainPanel` | FailureDefinitionId |
| `FailureDefinitionId CannotMaintainKeyReference { get; }` | `WallFailures.CannotMaintainKeyReference` | FailureDefinitionId |
| `FailureDefinitionId CannotMirrorWallPanel { get; }` | `WallFailures.CannotMirrorWallPanel` | FailureDefinitionId |
| `FailureDefinitionId CannotRedoFaceBased { get; }` | `WallFailures.CannotRedoFaceBased` | FailureDefinitionId |
| `FailureDefinitionId CannotRedoFaceBasedWarn { get; }` | `WallFailures.CannotRedoFaceBasedWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotRedoFaceRoof { get; }` | `WallFailures.CannotRedoFaceRoof` | FailureDefinitionId |
| `FailureDefinitionId CannotRedoFaceToposolid { get; }` | `WallFailures.CannotRedoFaceToposolid` | FailureDefinitionId |
| `FailureDefinitionId CannotSlantStackedWallError { get; }` | `WallFailures.CannotSlantStackedWallError` | FailureDefinitionId |
| `FailureDefinitionId CannotSplitJoinHostsInplaceFamilies { get; }` | `WallFailures.CannotSplitJoinHostsInplaceFamilies` | FailureDefinitionId |
| `FailureDefinitionId CannotSplitVerticallyCompoundWall { get; }` | `WallFailures.CannotSplitVerticallyCompoundWall` | FailureDefinitionId |
| `FailureDefinitionId CannotToSplitWallPanels { get; }` | `WallFailures.CannotToSplitWallPanels` | FailureDefinitionId |
| `FailureDefinitionId CannotUpdateWallPanel { get; }` | `WallFailures.CannotUpdateWallPanel` | FailureDefinitionId |
| `FailureDefinitionId ChangingWallsweepType { get; }` | `WallFailures.ChangingWallsweepType` | FailureDefinitionId |
| `FailureDefinitionId ConstrainedToWall { get; }` | `WallFailures.ConstrainedToWall` | FailureDefinitionId |
| `FailureDefinitionId ConstrainedToWallError { get; }` | `WallFailures.ConstrainedToWallError` | FailureDefinitionId |
| `FailureDefinitionId ContFootingCannotJoin { get; }` | `WallFailures.ContFootingCannotJoin` | FailureDefinitionId |
| `FailureDefinitionId ContFootingRadiusTooSmall { get; }` | `WallFailures.ContFootingRadiusTooSmall` | FailureDefinitionId |
| `FailureDefinitionId CurtainOrStackedWallDisallowedForCrossSectionType { get; }` | `WallFailures.CurtainOrStackedWallDisallowedForCrossSectionType` | FailureDefinitionId |
| `FailureDefinitionId DisallowedPathCurve { get; }` | `WallFailures.DisallowedPathCurve` | FailureDefinitionId |
| `FailureDefinitionId EmbeddedButShouldNotBe { get; }` | `WallFailures.EmbeddedButShouldNotBe` | FailureDefinitionId |
| `FailureDefinitionId ExtrudedWallDisallowedForCrossSectionType { get; }` | `WallFailures.ExtrudedWallDisallowedForCrossSectionType` | FailureDefinitionId |
| `FailureDefinitionId FaceBecameVertical { get; }` | `WallFailures.FaceBecameVertical` | FailureDefinitionId |
| `FailureDefinitionId FaceIsNoGoodForWall { get; }` | `WallFailures.FaceIsNoGoodForWall` | FailureDefinitionId |
| `FailureDefinitionId FaceIsNoLongerVertical { get; }` | `WallFailures.FaceIsNoLongerVertical` | FailureDefinitionId |
| `FailureDefinitionId FaceWallBadType { get; }` | `WallFailures.FaceWallBadType` | FailureDefinitionId |
| `FailureDefinitionId FaceWallComplexType { get; }` | `WallFailures.FaceWallComplexType` | FailureDefinitionId |
| `FailureDefinitionId FaceWallFailedToMake { get; }` | `WallFailures.FaceWallFailedToMake` | FailureDefinitionId |
| `FailureDefinitionId FaceWallMissingFace { get; }` | `WallFailures.FaceWallMissingFace` | FailureDefinitionId |
| `FailureDefinitionId FailedConvertWallToPanel { get; }` | `WallFailures.FailedConvertWallToPanel` | FailureDefinitionId |
| `FailureDefinitionId FailedToChangeInstSymbol { get; }` | `WallFailures.FailedToChangeInstSymbol` | FailureDefinitionId |
| `FailureDefinitionId FailedToStoreSideFace { get; }` | `WallFailures.FailedToStoreSideFace` | FailureDefinitionId |
| `FailureDefinitionId InvalidBaseConstraintForLevel { get; }` | `WallFailures.InvalidBaseConstraintForLevel` | FailureDefinitionId |
| `FailureDefinitionId InvalidCompoundStructure { get; }` | `WallFailures.InvalidCompoundStructure` | FailureDefinitionId |
| `FailureDefinitionId InvalidTargetPosition { get; }` | `WallFailures.InvalidTargetPosition` | FailureDefinitionId |
| `FailureDefinitionId InvalidTargetPositionError { get; }` | `WallFailures.InvalidTargetPositionError` | FailureDefinitionId |
| `FailureDefinitionId InvalidTopConstraintForLevel { get; }` | `WallFailures.InvalidTopConstraintForLevel` | FailureDefinitionId |
| `FailureDefinitionId LostEditsJoinsRedoFaceBased { get; }` | `WallFailures.LostEditsJoinsRedoFaceBased` | FailureDefinitionId |
| `FailureDefinitionId ParameterChangeNotAffectingGeometry { get; }` | `WallFailures.ParameterChangeNotAffectingGeometry` | FailureDefinitionId |
| `FailureDefinitionId RecursionParameterIgnored { get; }` | `WallFailures.RecursionParameterIgnored` | FailureDefinitionId |
| `FailureDefinitionId RemapConstrainLocationLine { get; }` | `WallFailures.RemapConstrainLocationLine` | FailureDefinitionId |
| `FailureDefinitionId ShorterThanMinWall { get; }` | `WallFailures.ShorterThanMinWall` | FailureDefinitionId |
| `FailureDefinitionId ShorterThanMinWallError { get; }` | `WallFailures.ShorterThanMinWallError` | FailureDefinitionId |
| `FailureDefinitionId ShorterThanMinWallFailure { get; }` | `WallFailures.ShorterThanMinWallFailure` | FailureDefinitionId |
| `FailureDefinitionId ShouldAdjustWallParameters { get; }` | `WallFailures.ShouldAdjustWallParameters` | FailureDefinitionId |
| `FailureDefinitionId StackedWallNeedsUnjoin { get; }` | `WallFailures.StackedWallNeedsUnjoin` | FailureDefinitionId |
| `FailureDefinitionId SubwallOfStackedWallDeleted { get; }` | `WallFailures.SubwallOfStackedWallDeleted` | FailureDefinitionId |
| `FailureDefinitionId TaperedWallAnglesControlledByType { get; }` | `WallFailures.TaperedWallAnglesControlledByType` | FailureDefinitionId |
| `FailureDefinitionId TooShortStackedWall { get; }` | `WallFailures.TooShortStackedWall` | FailureDefinitionId |
| `FailureDefinitionId UnableToCreateWallForPanel { get; }` | `WallFailures.UnableToCreateWallForPanel` | FailureDefinitionId |
| `FailureDefinitionId UnableToDeleteWallForPanel { get; }` | `WallFailures.UnableToDeleteWallForPanel` | FailureDefinitionId |
| `FailureDefinitionId UnjoinOnEditWallChange { get; }` | `WallFailures.UnjoinOnEditWallChange` | FailureDefinitionId |
| `FailureDefinitionId VerticalLayerExtensionFailure { get; }` | `WallFailures.VerticalLayerExtensionFailure` | FailureDefinitionId |
| `FailureDefinitionId VerticalLayerExtensionFailureError { get; }` | `WallFailures.VerticalLayerExtensionFailureError` | FailureDefinitionId |
| `FailureDefinitionId WallCutoutForInsertionFailure { get; }` | `WallFailures.WallCutoutForInsertionFailure` | FailureDefinitionId |
| `FailureDefinitionId WallLacksCurve { get; }` | `WallFailures.WallLacksCurve` | FailureDefinitionId |
| `FailureDefinitionId WallNegativeHeight { get; }` | `WallFailures.WallNegativeHeight` | FailureDefinitionId |
| `FailureDefinitionId WallSettingsChanged { get; }` | `WallFailures.WallSettingsChanged` | FailureDefinitionId |
| `FailureDefinitionId WallTypeIncompatibleWithTapered { get; }` | `WallFailures.WallTypeIncompatibleWithTapered` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```